rails/byte_size_news/app/controllers/news/search_controller.rb

SELECT "issues".* FROM "issues" WHERE (lower(content) LIKE '%SEMO %' OR lower(title) LIKE '%SEMO %')
SELECT "users".* FROM "users" WHERE (lower(last_name) LIKE '%a%' OR lower(first_name) LIKE '%a%')
---
    def search_feed
      @issues = Issue.search(params[:query])
      @users = User.search(params[:query])